{
    "subcategories": [
      {
        "name": "Mathematics",
        "toys": [
          {
            "name": "Math Blocks",
            "description": "Build and explore mathematical concepts with these colorful math blocks. They are designed to help children learn counting, addition, subtraction, and more in a fun and interactive way.",
            "price": "$19.99",
            "rating": 4.5,
            "picture": "https://i.ibb.co/ZTcNvTd/1.jpg"
          },
          {
            "name": "Counting Abacus",
            "description": "The counting abacus is a classic educational toy that helps children develop number sense and basic counting skills. It features colorful beads that can be slid back and forth on the rods to represent different numbers.",
            "price": "$12.99",
            "rating": 4.2,
            "picture": "https://i.ibb.co/YLKbHzH/2.jpg"
          }
        ]
      },
      {
        "name": "Science",
        "toys": [
          {
            "name": "Microscope Kit",
            "description": "Introduce your child to the fascinating world of science with this microscope kit. It comes with a high-quality microscope, prepared slides, and tools to help kids observe and explore the microscopic world.",
            "price": "$29.99",
            "rating": 4.8,
            "picture": "https://i.ibb.co/0fg0mmx/3.jpg"
          },
          {
            "name": "Chemistry Set",
            "description": "Spark your child's curiosity in chemistry with this hands-on chemistry set. It includes safe and age-appropriate experiments and materials to conduct exciting chemical reactions and learn about the basics of chemistry.",
            "price": "$24.99",
            "rating": 4.6,
            "picture": "https://i.ibb.co/qdJcFjJ/4.jpg"
          }
        ]
      },
      {
        "name": "Language",
        "toys": [
          {
            "name": "Alphabet Puzzle",
            "description": "Help your child learn the alphabet with this engaging alphabet puzzle. It features colorful pieces that fit together to form the complete alphabet, encouraging letter recognition and early language skills.",
            "price": "$9.99",
            "rating": 4.3,
            "picture": "https://i.ibb.co/3MxLzFD/5.jpg"
          },
          {
            "name": "Word Building Blocks",
            "description": "Enhance your child's vocabulary and spelling abilities with these word building blocks. Each block has letters printed on different sides, allowing kids to create various words and improve their language skills.",
            "price": "$14.99",
            "rating": 4.1,
            "picture": "https://i.ibb.co/FzNpM1S/6.jpg"
          }
        ]
      }
    ]
  }
  